In [1]:
## Normalization ---> Min = 0 and Max = 1

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

In [3]:
mn = MinMaxScaler()

Importing Churn Modeling Data

In [5]:
df = pd.read_csv("C:\\Users\\vedan\\OneDrive\\Documents\\Regex\\Python\\ML\\CSV Files\\Churn_Modelling - Churn_Modelling.csv")
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [6]:
df = df.drop(columns = ['Surname', 'CustomerId', 'Geography'])
df

,RowNumber,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,619,Female,42,2,0.00,1,1,1,101348.88,1
1,2,608,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,502,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,699,Female,39,1,0.00,2,0,0,93826.63,0
4,5,850,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,771,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,516,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,709,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,772,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,792,Female,28,4,130142.79,1,1,0,38190.78,0

In [7]:
df['Gender'] = df['Gender'].map({"Male" : 1, "Female" : 0})
df

,RowNumber,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,619,0,42,2,0.00,1,1,1,101348.88,1
1,2,608,0,41,1,83807.86,1,0,1,112542.58,0
2,3,502,0,42,8,159660.80,3,1,0,113931.57,1
3,4,699,0,39,1,0.00,2,0,0,93826.63,0
4,5,850,0,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,771,1,39,5,0.00,2,1,0,96270.64,0
9996,9997,516,1,35,10,57369.61,1,1,1,101699.77,0
9997,9998,709,0,36,7,0.00,1,0,1,42085.58,1
9998,9999,772,1,42,3,75075.31,2,1,0,92888.52,1
9999,10000,792,0,28,4,130142.79,1,1,0,38190.78,0

In [8]:

df['Gender'] = df['Gender'].map({"Male" : 1, "Female" : 0})
df

,RowNumber,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,619,NaN,42,2,0.00,1,1,1,101348.88,1
1,2,608,NaN,41,1,83807.86,1,0,1,112542.58,0
2,3,502,NaN,42,8,159660.80,3,1,0,113931.57,1
3,4,699,NaN,39,1,0.00,2,0,0,93826.63,0
4,5,850,NaN,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,771,NaN,39,5,0.00,2,1,0,96270.64,0
9996,9997,516,NaN,35,10,57369.61,1,1,1,101699.77,0
9997,9998,709,NaN,36,7,0.00,1,0,1,42085.58,1
9998,9999,772,NaN,42,3,75075.31,2,1,0,92888.52,1
9999,10000,792,NaN,28,4,130142.79,1,1,0,38190.78,0

In [9]:

x = df.drop(columns= ['Exited'])
y = df['Exited']

In [10]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)

In [11]:
x_train_mn = mn.fit_transform(x_train)

c:\Users\vedan\AppData\Local\Programs\Python\Python312\Lib\site-packages\sklearn\utils\_array_api.py:794: RuntimeWarning: All-NaN slice encountered
  return xp.asarray(numpy.nanmin(X, axis=axis))
c:\Users\vedan\AppData\Local\Programs\Python\Python312\Lib\site-packages\sklearn\utils\_array_api.py:814: RuntimeWarning: All-NaN slice encountered
  return xp.asarray(numpy.nanmax(X, axis=axis))

In [12]:
x_train_new = pd.DataFrame(x_train_mn, columns = x_train.columns)

In [13]:
np.round(x_train_new.describe(), 2)

,RowNumber,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
count,8000.00,8000.00,0.0,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00
mean,0.50,0.60,NaN,0.28,0.50,0.30,0.18,0.70,0.51,0.50
std,0.29,0.19,NaN,0.14,0.29,0.25,0.19,0.46,0.50,0.29
min,0.00,0.00,NaN,0.00,0.00,0.00,0.00,0.00,0.00,0.00
25%,0.25,0.47,NaN,0.19,0.30,0.00,0.00,0.00,0.00,0.26
50%,0.50,0.61,NaN,0.26,0.50,0.38,0.00,1.00,1.00,0.50
75%,0.75,0.74,NaN,0.35,0.70,0.51,0.33,1.00,1.00,0.75
max,1.00,1.00,NaN,1.00,1.00,1.00,1.00,1.00,1.00,1.00